КАКерамика_моя_старая_база/src/Reports/РегламентированноеУведомлениеВозвратНалога/РегламентированноеУведомлениеВозвратНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегламентированноеУведомлениеВозвратНалога</name>
</mdclass:Report>

КАКерамика_моя_старая_база/src/Enums/ВидыУведомленийОСпецрежимахНалогообложения/ВидыУведомленийОСпецрежимахНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомленийОСпецрежимахНалогообложения</name>
  <enumValues>
    <name>УведомлениеОПереходеНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУтратеПраваНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОтказеОтУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПрекращенииДеятельностиПоУСН</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатента</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОбУтратеПраваНаПатент</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД1</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД2</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД3</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД4</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_4</name>
  </enumValues>
  <enumValues>
    <name>Форма_1_6_Учет</name>
  </enumValues>
  <enumValues>
    <name>ФормаУ_ИО</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС1</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_6</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеИсключенииПроверки</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПостановкаОбъектаНВОС</name>
  </enumValues>
  <enumValues>
    <name>ФормаР21001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР24001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР11001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР13001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР13014</name>
  </enumValues>
  <enumValues>
    <name>ФормаР14001</name>
  </enumValues>
  <enumValues>
    <name>ФормаКИК</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОНаделенииОППолномочиямиПоВыплатам</name>
  </enumValues>
  <enumValues>
    <name>ФормаСИО</name>
  </enumValues>
  <enumValues>
    <name>НевозможностьПредоставленияДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОВозвратеНалога</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОЗачетеНалога</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияОХарактеристикахОбъектаНедвижимости</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПредоставленииРассрочкиФСС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПримененииНалоговойЛьготыУчастникамиРегиональныхИнвестиционныхПроектов</name>
  </enumValues>
  <enumValues>
    <name>ПостановкаСнятиеВКачествеНалоговогоАгента</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаРаскрытиеНалоговойТайны</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУчастникаСколково</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеДокументаНалоговогоРезидента</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУменьшениеНалогаККТ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОсвобождениеОтСтраховыхВзносов</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОткрытииЗакрытииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииРеквизитовСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОНаличииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПорядокПредставленияНалоговыхДеклараций</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеРанееПредставленныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеКЛМК</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПрекращениеЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтНДСПриЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеРегиональныхНалогов</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНДС</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОсвобождениеНалогНаПрибыльСколково</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОсвобождениеНДССколково</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСведенийСоставляющихНалоговуюТайну</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСуммыНВОС</name>
  </enumValues>
  <enumValues>
    <name>ЗачетСуммыНВОС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеЛьготаТранспортЗемля</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПриемДокументовФСС</name>
  </enumValues>
  <enumValues>
    <name>Уведомление1НачалоУплаты</name>
  </enumValues>
  <enumValues>
    <name>Уведомление2ОтказОтУплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДДС</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ВыборНалоговогоОрганаНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПереходНПДЕСХН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПереходНПДУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПорядокУплатыПрибыль</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОГибелиТранспортногоСредства</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПредоставленииРассрочкиПоНалоговымПлатежам</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПорядкаИсчисленияАвансовПоНалогуНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаСубсидиюДляЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>СубсидияНаПроведениеПрофилактики</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаИнформированиеОЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ЖалобаФНС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПроведенииНалоговогоМониторинга</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбОрганизацииСистемыВнутреннегоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СообщениеТранспортЗемля</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбУчастниках</name>
  </enumValues>
  <enumValues>
    <name>УчетнаяПолитика</name>
  </enumValues>
  <enumValues>
    <name>РегламентИнформационногоВзаимодействия</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаСправкиПоРасчетам</name>
  </enumValues>
  <enumValues>
    <name>СверкаРасчетовПоНалогам</name>
  </enumValues>
  <enumValues>
    <name>РеестрДокументовПодтверждающихЛьготы</name>
  </enumValues>
  <enumValues>
    <name>УменьшениеНалогаНаСтраховыеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСообщенийОСуммахНалогов</name>
  </enumValues>
  <enumValues>
    <name>РискиОрганизацииНалоговыйМониторинг</name>
  </enumValues>
  <enumValues>
    <name>СтруктураВзаимосвязейВнутриГруппыКомпаний</name>
  </enumValues>
  <enumValues>
    <name>РасшифровкаПоОКВЭД</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>РезультатыВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ОценкаСистемыВнутреннегоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>МероприятияПоСовершенствованию</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОРазницахБУиНУ</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОРискахПоОтдельнымСделкам</name>
  </enumValues>
  <enumValues>
    <name>МатрицаРисковКП</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияУдельныйВес</name>
  </enumValues>
  <enumValues>
    <name>ГрафикПереходаНалоговыйМониторинг</name>
  </enumValues>
  <enumValues>
    <name>ДорожнаяКартаНМ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявительныйПорядокВозмещенияНДСАкциз</name>
  </enumValues>
  <enumValues>
    <name>РеестрЛьготИмущество</name>
  </enumValues>
  <enumValues>
    <name>ЗапретПредставленияУполномоченнымиЛицами</name>
  </enumValues>
  <enumValues>
    <name>ЗапросМотивированногоМнения</name>
  </enumValues>
  <enumValues>
    <name>СогласиеСМотивированнымМнением</name>
  </enumValues>
  <enumValues>
    <name>РазногласиеСМотивированнымМнением</name>
  </enumValues>
  <enumValues>
    <name>ВзаимосогласительнаяПроцедура</name>
  </enumValues>
  <enumValues>
    <name>ИзъятиеТС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОГибелиИмущества</name>
  </enumValues>
  <enumValues>
    <name>ЛьготаПоНалогуНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>ФормаРГ00001</name>
  </enumValues>
  <enumValues>
    <name>ФормаРГ00002</name>
  </enumValues>
  <enumValues>
    <name>СубсидияПострадавшимМСП</name>
  </enumValues>
  <enumValues>
    <name>ЭлементДляВыпускаНовыхПатчей</name>
  </enumValues>
  <enumValues>
    <name>СубсидияПоПостановлению1513</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаДоходаЛицуНеИмеющемуПраваПолучения</name>
  </enumValues>
  <enumValues>
    <name>ОтзывЗапросаМотивированногоМнения</name>
  </enumValues>
  <enumValues>
    <name>ИсчисленныеСуммыНалогов</name>
  </enumValues>
  <enumValues>
    <name>ОсобыйПорядокУплатыНалогов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЕдиногоНалоговогоПлатежа</name>
  </enumValues>
  <enumValues>
    <name>СведенияОКадастровыхНомерах</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОПараметрахДоступаИС</name>
  </enumValues>
  <enumValues>
    <name>ПоясненияПоСуммамНалогов</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/УведомлениеОСпецрежимахНалогообложения/УведомлениеОСпецрежимахНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОСпецрежимахНалогообложения</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеУведомления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВИФНС</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Reports/РегламентированноеУведомлениеВозвратНалога/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьТаблицуПримененияФорматов() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуПримененияФорматов();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2021_1";
	Стр.КНД = "1150058";
	Стр.ВерсияФормата = "5.03";
	
	Возврат Результат;
КонецФункции

Функция ДанноеУведомлениеДоступноДляОрганизации() Экспорт 
	Возврат Истина;
КонецФункции

Функция ДанноеУведомлениеДоступноДляИП() Экспорт 
	Возврат Истина;
КонецФункции

Функция ПолучитьОсновнуюФорму() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьФормуПоУмолчанию() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьТаблицуФорм() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуФормУведомления();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2021_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 17.08.2021 № ЕД-7-8/757@";
	Стр.ДатаНачала = '20211023';
	Стр.ДатаКонца = '20990101';
	
	Возврат Результат;
КонецФункции

Функция ЭлектронноеПредставление(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2017_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2017_1(Объект, УникальныйИдентификатор);
	ИначеЕсли ИмяФормы = "Форма2018_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2018_1(Объект, УникальныйИдентификатор);
	ИначеЕсли ИмяФормы = "Форма2021_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2021_1(Объект, УникальныйИдентификатор);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПроверитьДокумент(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
КонецФункции

Функция СформироватьСписокЛистов(Объект) Экспорт
	Если Объект.ИмяФормы = "Форма2017_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2017_1(Объект);
	ИначеЕсли Объект.ИмяФормы = "Форма2018_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2018_1(Объект);
	ИначеЕсли Объект.ИмяФормы = "Форма2021_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2021_1(Объект);
	КонецЕсли;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт 
	Если ИмяФормы = "Форма2017_1" Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2017_1(УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	ИначеЕсли ИмяФормы = "Форма2018_1" Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2018_1(УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	ИначеЕсли ИмяФормы = "Форма2021_1" Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2021_1(УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления_Форма2017_1(СведенияОтправки)
	Префикс = "UT_ZVIUN";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления_Форма2018_1(СведенияОтправки)
	Префикс = "UT_ZVIUN";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления_Форма2021_1(СведенияОтправки)
	Префикс = "UT_ZVIUN";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу_Форма2017_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
		"Формат 5.01 устарел, необходимо создать форму в актуальной редакции", "Титульная", "ИНН"));
	Возврат ТаблицаОшибок;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу_Форма2018_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
		"Формат 5.02 устарел", "Титульная", "ИНН"));
	Возврат ТаблицаОшибок;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу_Форма2021_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	УведомлениеОСпецрежимахНалогообложения.ПроверкаАктуальностиФормыПриВыгрузке(
		Данные.Объект.ИмяФормы, ТаблицаОшибок, ПолучитьТаблицуФорм());
	
	Титульная = Данные.ДанныеУведомления.Титульная;
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Данные.Организация) Тогда 
		Если Не ЗначениеЗаполнено(Титульная.ИНН) 
			Или Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Титульная.ИНН, Истина, "") Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан/неправильно указан ИНН", "Титульная", "ИНН"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.КПП) 
			Или Не РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(Титульная.КПП, "") Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан/неправильно указан КПП", "Титульная", "КПП"));
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Титульная.ИНН)
		И Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Титульная.ИНН, Ложь, "") Тогда 
		
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан ИНН", "Титульная", "ИНН"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.ПРИЗНАК_НП_ПОДВАЛ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак подписанта", "Титульная", "ПРИЗНАК_НП_ПОДВАЛ"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ДАТА_ПОДПИСИ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата подписи", "Титульная", "ДАТА_ПОДПИСИ"));
	КонецЕсли;
	Если Титульная.ПРИЗНАК_НП_ПОДВАЛ = "1" Или Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2" Тогда 
		Если Не ЗначениеЗаполнено(Данные.ПодписантИмя) Или Не ЗначениеЗаполнено(Данные.ПодписантФамилия) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан подписант", "Титульная", "ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ"));
		КонецЕсли;
	КонецЕсли;
	Если Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2" И Не ЗначениеЗаполнено(Титульная.НаимДок) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан документ представителя", "Титульная", "НаимДок"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.НомерЗаяв) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан номер заявления", "Титульная", "НомерЗаяв"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.КодНО)
		Или (Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(Титульная.КодНО))
		Или СтрДлина(СокрЛП(Титульная.КодНО)) <> 4 Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан/неправильно указан налоговый орган", "Титульная", "КодНО"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.Наименование) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование организации/ФИО физлица", "Титульная", "Наименование"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.Сумма) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана сумма к возврату", "Титульная", "Сумма"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.ОКТМО) 
		Или (Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(Титульная.ОКТМО)) 
		Или (Не (СтрДлина(СокрЛП(Титульная.ОКТМО)) = 8 Или СтрДлина(СокрЛП(Титульная.ОКТМО)) = 11)) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан/неправильно заполнен ОКТМО", "Титульная", "ОКТМО"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.КБК) 
		Или (Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(Титульная.КБК))
		Или (Не (СтрДлина(СокрЛП(Титульная.КБК)) = 20))Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан/неправильно заполнен КБК", "Титульная", "КБК"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ПрИзлСум) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак излишней суммы", "Титульная", "ПрИзлСум"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ПрИзлПлат) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак излишнего платежа", "Титульная", "ПрИзлПлат"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ПрСтПлат) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак плательщика", "Титульная", "ПрСтПлат"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.НомерСтНК) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана статья НК РФ", "Титульная", "НомерСтНК"));
	КонецЕсли;
	
	СвСчБанк = Данные.ДанныеУведомления.СвСчБанк;
	Если Не ЗначениеЗаполнено(СвСчБанк.Л0101) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование банка", "СвСчБанк", "Л0101"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвСчБанк.ВидСчета) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан вид счета (код)", "СвСчБанк", "ВидСчета"));
	Иначе
		Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Данные.Организация) Тогда 
			Если СвСчБанк.ВидСчета = "02" Или СвСчБанк.ВидСчета = "07" Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Коды 02 и 07 доступны только для физических лиц", "СвСчБанк", "ВидСчета"));
			КонецЕсли;
		Иначе
			Если СвСчБанк.ВидСчета = "08" Или СвСчБанк.ВидСчета = "09" Или СвСчБанк.ВидСчета = "13" Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Коды 08, 09 и 13 доступны только для юридических лиц", "СвСчБанк", "ВидСчета"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвСчБанк.Л0105) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак номера счета", "СвСчБанк", "Л0105"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвСчБанк.Л0104)
		Или (Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(СвСчБанк.Л0104))
		Или (Не (СтрДлина(СокрЛП(СвСчБанк.Л0104)) = 9)) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан/неправльно указан БИК", "СвСчБанк", "Л0104"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвСчБанк.Л0106) 
		Или (Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(СвСчБанк.Л0106))
		Или (Не (СтрДлина(СокрЛП(СвСчБанк.Л0106)) = 20)) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан/неправльно указан счет", "СвСчБанк", "Л0106"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвСчБанк.ПрПолучатель) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак получателя", "СвСчБанк", "ПрПолучатель"));
	КонецЕсли;
	
	Если СвСчБанк.ПрПолучатель = "2" Тогда 
		Если Не ЗначениеЗаполнено(СвСчБанк.ФамилияПолучатель) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана фамилия получателя", "СвСчБанк", "ФамилияПолучатель"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СвСчБанк.ИмяПолучатель) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано имя получателя", "СвСчБанк", "ИмяПолучатель"));
		КонецЕсли;
	ИначеЕсли СвСчБанк.ПрПолучатель = "1" Тогда 
		Если Не ЗначениеЗаполнено(СвСчБанк.Л0107) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование получателя", "СвСчБанк", "Л0107"));
		КонецЕсли;
	ИначеЕсли СвСчБанк.ПрПолучатель = "3" Тогда 
		Если Не ЗначениеЗаполнено(СвСчБанк.НаимОргЛицСч) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование органа, осуществляющего открытие и ведение лицевых счетов", "СвСчБанк", "НаимОргЛицСч"));
		КонецЕсли;
		Если ЗначениеЗаполнено(СвСчБанк.КБК) 
				И (СтрДлина(СвСчБанк.КБК) <> 20 
				Или (Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СвСчБанк.КБК))) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Неправильно указан КБК", "СвСчБанк", "КБК"));
		КонецЕсли;
		Если ЗначениеЗаполнено(СвСчБанк.СчетПолучателя) 
			И СтрДлина(СвСчБанк.СчетПолучателя) <> 11 Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Неправильно указан номер лицевого счета получателя", "СвСчБанк", "СчетПолучателя"));
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.ДанныеУведомления.Свойство("УдЛичнФЛ")
		И Не ЗначениеЗаполнено(Титульная.ИНН) Тогда
		
		УдЛичнФЛ = Данные.ДанныеУведомления.УдЛичнФЛ;
		Если Не ЗначениеЗаполнено(УдЛичнФЛ.КодВидДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан код вида документа", "УдЛичнФЛ", "КодВидДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(УдЛичнФЛ.СерНомДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указаны серия и номер документа", "УдЛичнФЛ", "СерНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(УдЛичнФЛ.ВыдДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан орган, выдавший документ", "УдЛичнФЛ", "ВыдДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(УдЛичнФЛ.ДатаДок) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата выдачи документа", "УдЛичнФЛ", "ДатаДок"));
		КонецЕсли;
	КонецЕсли;
	
	УведомлениеОСпецрежимахНалогообложения.ПроверкаДатВУведомлении(Данные, ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложения.ПолнаяПроверкаЗаполненныхПоказателейНаСоотвествиеСписку(
		"СпискиВыбора2021_1", "СхемаВыгрузкиФорма2021_1",
		Данные.Объект.ИмяОтчета, ТаблицаОшибок, Данные);
	Возврат ТаблицаОшибок;
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления_Форма2017_1(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	
	Данные = Объект.ДанныеУведомления.Получить();
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления_Форма2017_1(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	ОсновныеСведения.Вставить("ПрОФЛ", Данные.ДанныеУведомления.Лист001.ПрОФЛ);
	
	Возврат ОсновныеСведения;
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления_Форма2018_1(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	
	Данные = Объект.ДанныеУведомления.Получить();
	ОсновныеСведения.Вставить("КодНО", Данные.ДанныеУведомления.Титульная_2018.КодНО);
	ОсновныеСведения.Вставить("ПрПодп", Данные.ДанныеУведомления.Титульная_2018.ПРИЗНАК_НП_ПОДВАЛ);
	ОсновныеСведения.Вставить("ТлфПодп", Данные.ДанныеУведомления.Титульная_2018.Тлф);
	ОсновныеСведения.Вставить("ИННТитул", Данные.ДанныеУведомления.Титульная_2018.ИНН);
	ОсновныеСведения.Вставить("ИННЮЛ", Данные.ДанныеУведомления.Титульная_2018.ИНН);
	ОсновныеСведения.Вставить("ИННФЛ", Данные.ДанныеУведомления.Титульная_2018.ИНН);
	ОсновныеСведения.Вставить("КПП", Данные.ДанныеУведомления.Титульная_2018.КПП);
	ОсновныеСведения.Вставить("НаимДок", Данные.ДанныеУведомления.Титульная_2018.НаимДок);
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления_Форма2018_1(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	ОсновныеСведения.Вставить("ПрПолуч", Данные.ДанныеУведомления.Лист001_2018.ПрПолучатель);
	
	Возврат ОсновныеСведения;
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления_Форма2021_1(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	Данные = Объект.ДанныеУведомления.Получить();
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления_Форма2021_1(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	ОсновныеСведения.Вставить("ПрПолуч", Данные.ДанныеУведомления.СвСчБанк.ПрПолучатель);
	Возврат ОсновныеСведения;
КонецФункции

Функция ЭлектронноеПредставление_Форма2017_1(Объект, УникальныйИдентификатор)
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2017_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления_Форма2017_1(Объект, УникальныйИдентификатор);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2017_1");
	ДополнитьПараметры(ДанныеУведомления);
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Функция ЭлектронноеПредставление_Форма2018_1(Объект, УникальныйИдентификатор)
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2018_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления_Форма2018_1(Объект, УникальныйИдентификатор);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2018_1");
	ДополнитьПараметры_2018(ДанныеУведомления);
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Функция ЭлектронноеПредставление_Форма2021_1(Объект, УникальныйИдентификатор)
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2021_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления_Форма2021_1(Объект, УникальныйИдентификатор);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2021_1");
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Процедура ДополнитьПараметры(Параметры)
	Если ЗначениеЗаполнено(Параметры.ДанныеУведомления.Титульная.Месяц) Тогда 
		Месяц = Прав("00" + Параметры.ДанныеУведомления.Титульная.Месяц, 2);
	Иначе
		Месяц = "00";
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ДанныеУведомления.Титульная.Год) Тогда 
		Год = Прав("0000" + Параметры.ДанныеУведомления.Титульная.Год, 4);
	Иначе
		Год = "0000";
	КонецЕсли;
	
	Параметры.ДанныеУведомления.Титульная.Вставить("НалПериод1", Строка(Параметры.ДанныеУведомления.Титульная.КодПериода) + "." + Месяц + "." + Год);
	НомерСтНК = Строка(Параметры.ДанныеУведомления.Титульная.Пункт);
	Если ЗначениеЗаполнено(Параметры.ДанныеУведомления.Титульная.Подпункт) Тогда 
		НомерСтНК = НомерСтНК + "." + Строка(Параметры.ДанныеУведомления.Титульная.Подпункт);
	КонецЕсли;
	Параметры.ДанныеУведомления.Титульная.Вставить("НомерСтНК", НомерСтНК);
	Параметры.ДанныеУведомления.Лист001.Л0110 = Формат(Параметры.ДанныеУведомления.Лист001.Л0110, "ДФ=dd.MM.yyyy");
КонецПроцедуры

Процедура ДополнитьПараметры_2018(Параметры)
	Если ЗначениеЗаполнено(Параметры.ДанныеУведомления.Титульная_2018.Месяц) Тогда 
		Месяц = Прав("00" + Параметры.ДанныеУведомления.Титульная_2018.Месяц, 2);
	Иначе
		Месяц = "00";
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ДанныеУведомления.Титульная_2018.Год) Тогда 
		Год = Прав("0000" + Параметры.ДанныеУведомления.Титульная_2018.Год, 4);
	Иначе
		Год = "0000";
	КонецЕсли;
	
	Параметры.ДанныеУведомления.Титульная_2018.Вставить("НалПериод1", Строка(Параметры.ДанныеУведомления.Титульная_2018.КодПериода) + "." + Месяц + "." + Год);
	НомерСтНК = Строка(Параметры.ДанныеУведомления.Титульная_2018.Пункт);
	Если ЗначениеЗаполнено(Параметры.ДанныеУведомления.Титульная_2018.Подпункт) Тогда 
		НомерСтНК = НомерСтНК + "." + Строка(Параметры.ДанныеУведомления.Титульная_2018.Подпункт);
	КонецЕсли;
	Параметры.ДанныеУведомления.Титульная_2018.Вставить("НомерСтНК", НомерСтНК);
КонецПроцедуры

Функция СформироватьСписокЛистовФорма2017_1(Объект) Экспорт
	СписокИспользуемыхМакетов = УведомлениеОСпецрежимахНалогообложения.ЗагрузитьМакетыИзАрхива(Объект, "БланкиПечати_");
	Листы = Новый СписокЗначений;
	
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	СтруктураПараметров = Объект.Ссылка.ДанныеУведомления.Получить();
	ИННКПП = Новый Структура();
	ИННКПП.Вставить("ИНН", СтруктураПараметров.ДанныеУведомления.Титульная.ИНН);
	ИННКПП.Вставить("КПП", СтруктураПараметров.ДанныеУведомления.Титульная.КПП);
	
	НомСтр = 0;
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Титульная"], НомСтр,
		УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2017_1_Титульная"), ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантФамилия, "ПодпФ", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантИмя, "ПодпИ", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантОтчество, "ПодпО", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Лист001"], НомСтр,
		УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2017_1_Лист001"), ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ДанныеУведомления.Титульная.ИНН)
		И Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		
		УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Лист002"], НомСтр,
			УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2017_1_Лист002"), ПечатнаяФорма, ИННКПП);
		УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	КонецЕсли;
	
	Возврат Листы;
КонецФункции

Функция СформироватьСписокЛистовФорма2018_1(Объект) Экспорт
	СписокИспользуемыхМакетов = УведомлениеОСпецрежимахНалогообложения.ЗагрузитьМакетыИзАрхива(Объект, "БланкиПечати_");
	Листы = Новый СписокЗначений;
	
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	СтруктураПараметров = Объект.Ссылка.ДанныеУведомления.Получить();
	ИННКПП = Новый Структура();
	ИННКПП.Вставить("ИНН", СтруктураПараметров.ДанныеУведомления.Титульная_2018.ИНН);
	ИННКПП.Вставить("КПП", СтруктураПараметров.ДанныеУведомления.Титульная_2018.КПП);
	
	НомСтр = 0;
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Титульная_2018"], НомСтр,
		УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2018_1_Титульная"), ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантФамилия, "ПодпФ", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантИмя, "ПодпИ", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантОтчество, "ПодпО", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Лист001_2018"], НомСтр, 
		УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2018_1_Лист001"), ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ДанныеУведомления.Титульная_2018.ИНН)
		И Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		
		УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Лист002_2018"], НомСтр, 
			УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2018_1_Лист002"), ПечатнаяФорма, ИННКПП);
		УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	КонецЕсли;
	
	Возврат Листы;
КонецФункции

Функция СформироватьСписокЛистовФорма2021_1(Объект) Экспорт
	СписокИспользуемыхМакетов = УведомлениеОСпецрежимахНалогообложения.ЗагрузитьМакетыИзАрхива(Объект, "БланкиПечати_");
	Листы = Новый СписокЗначений;
	
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	СтруктураПараметров = Объект.Ссылка.ДанныеУведомления.Получить();
	ИННКПП = Новый Структура();
	ИННКПП.Вставить("ИНН", СтруктураПараметров.ДанныеУведомления.Титульная.ИНН);
	ИННКПП.Вставить("КПП", СтруктураПараметров.ДанныеУведомления.Титульная.КПП);
	
	НомСтр = 0;
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["Титульная"], НомСтр, 
		УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2021_1_Титульная"), ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантФамилия, "ПодпФ", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантИмя, "ПодпИ", ПечатнаяФорма.Области, "-");
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Объект.ПодписантОтчество, "ПодпО", ПечатнаяФорма.Области, "-");
	РазложениеСтатьиНК = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Строка(СтруктураПараметров.ДанныеУведомления["Титульная"].НомерСтНК), ".");
	Если РазложениеСтатьиНК.Количество() > 1 Тогда 
		УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(РазложениеСтатьиНК[0], "Пункт", ПечатнаяФорма.Области, "-");
		УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(РазложениеСтатьиНК[1], "Подпункт", ПечатнаяФорма.Области, "-");
	ИначеЕсли РазложениеСтатьиНК.Количество() = 1 Тогда 
		УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(РазложениеСтатьиНК[0], "Пункт", ПечатнаяФорма.Области, "-");
		УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать("", "Подпункт", ПечатнаяФорма.Области, "-");
	Иначе
		УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать("", "Пункт", ПечатнаяФорма.Области, "-");
		УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать("", "Подпункт", ПечатнаяФорма.Области, "-");
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["СвСчБанк"], НомСтр, 
		УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2021_1_СвСчБанк"), ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ДанныеУведомления.Титульная.ИНН)
		И Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		
		УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета, СтруктураПараметров.ДанныеУведомления["УдЛичнФЛ"], НомСтр, 
			УведомлениеОСпецрежимахНалогообложения.ПустойМакетИзСписка(Объект, СписокИспользуемыхМакетов, "Печать_Форма2021_1_УдЛичнФЛ"), ПечатнаяФорма, ИННКПП);
		УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	КонецЕсли;
	
	Возврат Листы;
КонецФункции

Процедура КонвертацияИзРегламентированногоОтчета(ВыборкаСтрока) Экспорт
	Попытка
		Если ВыборкаСтрока.ВыбраннаяФорма = "ФормаОтчета2017Кв1" Тогда
			КонвертироватьНаСервере_2017(ВыборкаСтрока.Ссылка);
		ИначеЕсли ВыборкаСтрока.ВыбраннаяФорма = "ФормаОтчета2018Кв1" Тогда
			КонвертироватьНаСервере_2018(ВыборкаСтрока.Ссылка);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция СформироватьПустоеДеревоСтраниц_2018(Организация)
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УИД", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Дерево.Колонки.Добавить("ИмяМакета", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Многостраничность", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("Многострочность", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("ИДНаименования", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("МногострочныеЧасти", Новый ОписаниеТипов("СписокЗначений"));
	Дерево.Колонки.Добавить("МакетыПФ", Новый ОписаниеТипов("Строка"));
	
	Стр001 = Дерево.Строки.Добавить();
	Стр001.Наименование = "Титульная страница";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Титульная_2018";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Титульная_2018";
	Стр001.МакетыПФ = "Печать_Форма2018_1_Титульная";
	Стр001.МногострочныеЧасти = Новый СписокЗначений;
	
	Стр001 = Дерево.Строки.Добавить();
	Стр001.Наименование = "Сведения о"+символы.ПС+"счете в банке";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Лист001_2018";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Лист001_2018";
	Стр001.МакетыПФ = "Печать_Форма2018_1_Лист001";
	Стр001.МногострочныеЧасти = Новый СписокЗначений;
	
	Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		Стр001 = Дерево.Строки.Добавить();
		Стр001.Наименование = "Сведения о физическом"+символы.ПС+"лице, не являющимся"+символы.ПС+"индивидуальным предпринимателем";
		Стр001.ИндексКартинки = 1;
		Стр001.ИмяМакета = "Лист002_2018";
		Стр001.Многостраничность = Ложь;
		Стр001.Многострочность = Ложь;
		Стр001.УИД = Новый УникальныйИдентификатор;
		Стр001.ИДНаименования = "Лист002_2018";
		Стр001.МакетыПФ = "Печать_Форма2018_1_Лист002";
		Стр001.МногострочныеЧасти = Новый СписокЗначений;
	КонецЕсли;
	
	Возврат Дерево;
КонецФункции

Функция СформироватьПустоеДеревоСтраниц_2017(Организация)
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("УИД", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Дерево.Колонки.Добавить("ИмяМакета", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Многостраничность", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("Многострочность", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("ИДНаименования", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("МногострочныеЧасти", Новый ОписаниеТипов("СписокЗначений"));
	Дерево.Колонки.Добавить("МакетыПФ", Новый ОписаниеТипов("Строка"));
	
	Стр001 = Дерево.Строки.Добавить();
	Стр001.Наименование = "Титульная страница";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Титульная";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Титульная";
	Стр001.МакетыПФ = "Печать_Форма2017_1_Титульная";
	Стр001.МногострочныеЧасти = Новый СписокЗначений;
	
	Стр001 = Дерево.Строки.Добавить();
	Стр001.Наименование = "Сведения о"+символы.ПС+"счете в банке";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Лист001";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Лист001";
	Стр001.МакетыПФ = "Печать_Форма2017_1_Лист001";
	Стр001.МногострочныеЧасти = Новый СписокЗначений;
	
	Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		Стр001 = Дерево.Строки.Добавить();
		Стр001.Наименование = "Сведения о физическом"+символы.ПС+"лице, не являющимся"+символы.ПС+"индивидуальным предпринимателем";
		Стр001.ИндексКартинки = 1;
		Стр001.ИмяМакета = "Лист002";
		Стр001.Многостраничность = Ложь;
		Стр001.Многострочность = Ложь;
		Стр001.УИД = Новый УникальныйИдентификатор;
		Стр001.ИДНаименования = "Лист002";
		Стр001.МакетыПФ = "Печать_Форма2017_1_Лист002";
		Стр001.МногострочныеЧасти = Новый СписокЗначений;
	КонецЕсли;
	
	Возврат Дерево;
КонецФункции

Процедура КонвертироватьНаСервере_2018(РегОтчет)
	Попытка
		РО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РегОтчет, "КодНалоговогоОргана,ДанныеОтчета,ДатаПодписи,Организация,Дата");
		ДанныеОтчета = РО.ДанныеОтчета.Получить();
		
		Уведомление = Документы.УведомлениеОСпецрежимахНалогообложения.СоздатьДокумент();
		Уведомление.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОВозвратеНалога;
		Уведомление.Организация = РО.Организация;
		Уведомление.ИмяОтчета = "РегламентированноеУведомлениеВозвратНалога";
		Уведомление.ИмяФормы = "Форма2018_1";
		Уведомление.ПодписантФамилия = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.ПодпФ;
		Уведомление.ПодписантИмя = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.ПодпИ;
		Уведомление.ПодписантОтчество = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.ПодпО;
		Уведомление.ДатаПодписи = РО.Дата;
		Уведомление.Дата = ТекущаяДатаСеанса();
		
		ДанныеУведомления = Новый Структура;
		Титульный = Новый Структура;
		Для Каждого КЗ Из ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный Цикл 
			Титульный.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		Титульный.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", СокрЛП(Титульный.ПодпФ + " " + Титульный.ПодпИ + " " + Титульный.ПодпО));
		Титульный.Вставить("ИНН", Титульный.ИННШапка);
		Титульный.Вставить("КПП", Титульный.КППШапка);
		ДанныеУведомления.Вставить("Титульная_2018", Титульный);
		Лист001 = Новый Структура;
		Для Каждого КЗ Из ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаЛист001 Цикл 
			Лист001.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		ДанныеУведомления.Вставить("Лист001_2018", Лист001);
		
		Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(РО.Организация) Тогда
			Лист002 = Новый Структура;
			Для Каждого КЗ Из ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаЛист002 Цикл 
				Лист002.Вставить(КЗ.Ключ, КЗ.Значение);
			КонецЦикла;
			ДанныеУведомления.Вставить("Лист002_2018", Лист002);
		КонецЕсли;
		
		Уведомление.РегистрацияВИФНС = УведомлениеОСпецрежимахНалогообложенияПовтИсп.ПолучитьРегистрациюВИФНСПоКоду(Титульный.КодНО, РО.Организация);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДеревоСтраниц", СформироватьПустоеДеревоСтраниц_2018(РО.Организация));
		СтруктураПараметров.Вставить("ДанныеУведомления", ДанныеУведомления);
		СтруктураПараметров.Вставить("РазрешитьВыгружатьСОшибками", Ложь);
		Уведомление.ДанныеУведомления = Новый ХранилищеЗначения(СтруктураПараметров);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Уведомление);
		
		ЗаписьСоответствия = РегистрыСведений["СоответствиеРегОтчетовУведомлениям"].СоздатьМенеджерЗаписи();
		ЗаписьСоответствия.РегОтчет = РегОтчет.Ссылка;
		ЗаписьСоответствия.Прочитать();
		ЗаписьСоответствия.РегОтчет = РегОтчет.Ссылка;
		ЗаписьСоответствия.Уведомление = Уведомление.Ссылка;
		ЗаписьСоответствия.Записать(Истина);
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура КонвертироватьНаСервере_2017(РегОтчет)
	Попытка
		РО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РегОтчет, "КодНалоговогоОргана,ДанныеОтчета,ДатаПодписи,Организация,Дата");
		ДанныеОтчета = РО.ДанныеОтчета.Получить();
		
		Уведомление = Документы.УведомлениеОСпецрежимахНалогообложения.СоздатьДокумент();
		Уведомление.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеОВозвратеНалога;
		Уведомление.Организация = РО.Организация;
		Уведомление.ИмяОтчета = "РегламентированноеУведомлениеВозвратНалога";
		Уведомление.ИмяФормы = "Форма2017_1";
		Уведомление.ПодписантФамилия = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.ПодпФ;
		Уведомление.ПодписантИмя = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.ПодпИ;
		Уведомление.ПодписантОтчество = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.ПодпО;
		Уведомление.ДатаПодписи = РО.Дата;
		Уведомление.Дата = ТекущаяДатаСеанса();
		
		ДанныеУведомления = Новый Структура;
		Титульный = Новый Структура;
		Для Каждого КЗ Из ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный Цикл 
			Титульный.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		Титульный.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", СокрЛП(Титульный.ПодпФ + " " + Титульный.ПодпИ + " " + Титульный.ПодпО));
		Титульный.Вставить("ИНН", Титульный.ИННШапка);
		Титульный.Вставить("КПП", Титульный.КППШапка);
		ДанныеУведомления.Вставить("Титульная", Титульный);
		Лист001 = Новый Структура;
		Для Каждого КЗ Из ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаЛист001 Цикл 
			Лист001.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		ДанныеУведомления.Вставить("Лист001", Лист001);
		
		Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(РО.Организация) Тогда
			Лист002 = Новый Структура;
			Для Каждого КЗ Из ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаЛист002 Цикл 
				Лист002.Вставить(КЗ.Ключ, КЗ.Значение);
			КонецЦикла;
			ДанныеУведомления.Вставить("Лист002", Лист002);
		КонецЕсли;
		
		Уведомление.РегистрацияВИФНС = УведомлениеОСпецрежимахНалогообложенияПовтИсп.ПолучитьРегистрациюВИФНСПоКоду(Титульный.КодНО, РО.Организация);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДеревоСтраниц", СформироватьПустоеДеревоСтраниц_2017(РО.Организация));
		СтруктураПараметров.Вставить("ДанныеУведомления", ДанныеУведомления);
		СтруктураПараметров.Вставить("РазрешитьВыгружатьСОшибками", Ложь);
		Уведомление.ДанныеУведомления = Новый ХранилищеЗначения(СтруктураПараметров);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Уведомление);
		
		ЗаписьСоответствия = РегистрыСведений["СоответствиеРегОтчетовУведомлениям"].СоздатьМенеджерЗаписи();
		ЗаписьСоответствия.РегОтчет = РегОтчет.Ссылка;
		ЗаписьСоответствия.Прочитать();
		ЗаписьСоответствия.РегОтчет = РегОтчет.Ссылка;
		ЗаписьСоответствия.Уведомление = Уведомление.Ссылка;
		ЗаписьСоответствия.Записать(Истина);
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
#КонецЕсли
